In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [7]:
s1 = Series(np.random.randn(6), index=[['1','1','1','2','2','2'],['a','b','c','a','b','c']])

In [8]:
s1

1  a   -0.133603
   b    0.377868
   c   -1.266542
2  a   -2.118091
   b   -0.626403
   c    0.412578
dtype: float64

In [9]:
type(s1)

pandas.core.series.Series

In [10]:
s1['1']['a']

-0.13360317484288325

In [11]:
s1[:'a']

1  a   -0.133603
   b    0.377868
   c   -1.266542
2  a   -2.118091
   b   -0.626403
   c    0.412578
dtype: float64

In [14]:
df1 = s1.unstack()# 多级index Series转换成DataFrame

In [15]:
df1

          a         b         c
1 -0.133603  0.377868 -1.266542
2 -2.118091 -0.626403  0.412578

In [19]:
df2 = DataFrame([s1['1'],s1['2']])

In [20]:
df2

          a         b         c
0 -0.133603  0.377868 -1.266542
1 -2.118091 -0.626403  0.412578

In [21]:
s2 = df1.unstack()

In [22]:
s2

a  1   -0.133603
   2   -2.118091
b  1    0.377868
   2   -0.626403
c  1   -1.266542
   2    0.412578
dtype: float64

In [23]:
s2 = df1.T.unstack()

In [24]:
s2

1  a   -0.133603
   b    0.377868
   c   -1.266542
2  a   -2.118091
   b   -0.626403
   c    0.412578
dtype: float64

In [33]:
df3 = DataFrame(np.arange(16).reshape(4,4), index=[['a','a','b','b'],[1,2,1,2]], columns=[['BJ','BJ','SH','GZ'],[8,9,8,8]])

In [30]:
df3

     BJ  Bj  SH  GZ
      8   9   8   8
a 1   0   1   2   3
  2   4   5   6   7
b 1   8   9  10  11
  2  12  13  14  15

In [34]:
df3['BJ']

      8   9
a 1   0   1
  2   4   5
b 1   8   9
  2  12  13

In [35]:
df3['BJ'].unstack()

   8      9
   1   2  1   2
a  0   4  1   5
b  8  12  9  13

In [36]:
type(df3['BJ'])

pandas.core.frame.DataFrame